/*
**===========================================================================
**  1       GENERAL
**  1.1     Revisions
**
**  Please read the IAR MakeApp for Philips LPC2138-48 readme file
**
**
**===========================================================================
*/

/*
**===========================================================================
**  1.2     References
**
**  No   Identification          Name or Description
**  ==   ===================     ================================
**  1    November 22, 2004       Philips LPC2131/2132/2138
**                               User Manual, Preliminary Release
**
**===========================================================================
*/

/*
**===========================================================================
**  1.3     Re-definition guard
**===========================================================================
*/

/*--- Avoid including this file more than once ---*/
#ifndef _IS_INCLUDED_SPI_H
#define _IS_INCLUDED_SPI_H

/* usercode/template redefinition guard */
/*
**===========================================================================
**  2.      INCLUDE FILES
**  2.1     Standard include files
**===========================================================================
*/

#include "type.h"


/*
**===========================================================================
**  2.2     Application include files
**===========================================================================
*/

/*
**===========================================================================
**  3.      DECLARATIONS
**  3.1     Global constants
**===========================================================================
*/

/*
**===========================================================================
**  3.2     Global macros
**===========================================================================
*/


/*--- User code for the SCB module ---*/



/*
**===========================================================================
**  3.3     Global type definitions
**===========================================================================
*/

extern union{
    char spi0_status;
    RXTX spi0_sts_bit;
};

extern char spi0_status_rg;

extern char check_sum_tx, check_sum_rx;

/*
**===========================================================================
**  3.4     Global variables (defined in some implementation file)
**===========================================================================
*/

/*
**===========================================================================
**  4.      GLOBAL FUNCTIONS (defined in some implementation file)
**===========================================================================
*/

void spi0(char device, void *src, void *dest, unsigned int count);

void spi_prtcl();

extern unsigned int T0,T1,X,Y,Z1,Z2;
extern SPI_TOUCH_TX spi_touch_tx;//T0,T1,X,Y
extern SPI_TOUCH_RX spi_touch_rx;




extern char spi_device;//три плати на spi

extern signed short temperature[32];//буфер для температури - різниця між Т1 і Т0
extern char t_index;//індекс щоб рухатичь по буферуж
extern unsigned int skey,sbkey;//отримані від клавіатури кнопка і всі кнопки побітово

#endif /* Match the re-definition guard */

/*
**===========================================================================
** END OF FILE
**===========================================================================
*/


