


/*****************************************************************************/
///////////////////////////////////////////////////////////////////////////////
/*****************************************************************************/
/*
#define seq_SIZE 16

class task_seq
{
    public:

    char seq[seq_SIZE];   //послідовність операцій
    char w,r;       //вказівники писання і читання
    bool l_op;      //остання операція 0 - запис 1 - читання

    task_seq();//конструктор
    char push(char ch);//повертає 0xff при повному
    char pop();//повертає 0xff при порожньому
};

task_seq::task_seq()
{
    w = 0;   //ініціалізація
    r = 0;
    l_op = 1;//читання
}

char task_seq::push(char ch)
{
    //якщо вказівники збігаються і остання операція - читання то поржньо
    if(w != r || w==r && l_op){
        seq[w] = ch;
        l_op = 0;//остання операція - запис
        w = ++w % seq_SIZE;//інкрементувати вказівник і обмежити його розміром буфера
    }
    else return 0xff;//нема місця
}
char task_seq::pop()
{
    char ch
    //якщо вказівники збігаються і остання операція - запис то повний
    if(w != r || w=r && !l_op){
        ch = seq[r];
        l_op = 1;//остання операція - читання
        r = ++r % seq_SIZE;//інкрементувати вказівник і обмежити його розміром буфера
        return ch;
    }
    else return 0xff;//нема що читати
}
*/

/*****************************************************************************/
///////////////////////////////////////////////////////////////////////////////
/*****************************************************************************/

/*****************************************************************************/
///////////////////////////////////////////////////////////////////////////////
/*****************************************************************************/


/*****************************************************************************/
///////////////////////////////////////////////////////////////////////////////
/*****************************************************************************/






